<?php
/**
 * Created by PhpStorm.
 * User: zhaowenxi
 * Date: 2016/8/22
 * Time: 15:14
 */
return [
    'CODE_AND_MSG' => [
        20000 => '成功',

        40001 => '帐号或密码不能为空！',
        40002 => '账号不存在！',
        40003 => '密码不正确！',
        40004 => '删除失败！',
        40005 => '验证码不能为空！',
        40006 => '验证码错误！',
        40007 => '内容不能为空！',
        40008 => '请输入正确的邮箱！',
        40009 => '昵称不能为空！',
        40010 => '密码不能为空！',
        40011 => '手机不能为空！',
        40012 => '邮箱不能为空！',
        40013 => '请输入正确的手机！',
        40014 => '添加失败',
        40015 => '请填写内容！',
        

        50000 => '缺失参数',
        50001 => '验证码发送失败',
        50002 => '请求得太频繁啦！',
        50003 => '用户名或邮箱或手机已存在',


        99999 => '未知错误',
    ],
];